/* ====================================================================== */
/* Auth Dialog */

/* ---------------------------------------------------------------------- */
/* Window Titles */
"ENTER_CREDENTIALS" = "Ввести параметры доступа";
"CONNECT_TO_SERVER" = "Подключение к серверу";
"PRINTER_AUTH" = "Идентификация принтера";
"SCREEN_SHARE_AUTH" = "Общий экран";

/* ---------------------------------------------------------------------- */
/* Auth Dialog Messages */

/* Generic Connect */
"GENERIC_MSG_BOTH" = "Введите имя и пароль, чтобы подключиться к «%@».";
"GENERIC_MSG_PASS" = "Введите пароль, чтобы подключиться к «%@».";
"GENERIC_MSG_NONAME" = "Введите Ваше имя пользователя и пароль.";

/* Protocol Specific */
"AFP_MSG" = "Введите имя и пароль для сервера «%@».";
"SMB_MSG" = "Введите имя и пароль для сервера «%@».";
"FTP_MSG" = "Введите имя и пароль для сервера «%@».";
"WEBDAV_MSG" = "Введите имя и пароль для сервера «%@».";

/* File Server */
"FS_MSG_BOTH" = "Введите имя и пароль для сервера «%@».";
"FS_MSG_PASS" = "Введите пароль для сервера «%@».";

/* Generic Server */
"SRV_MSG_BOTH" = "Введите имя и пароль для сервера «%@».";
"SRV_MSG_PASS" = "Введите пароль для сервера «%@».";

/* Printer */
"PRINT_MSG_BOTH" = "Введите имя и пароль для принтера «%@».";
"PRINT_MSG_PASS" = "Введите пароль для принтера «%@».";

/* Print Server */
"PS_MSG_BOTH" = "Введите имя пользователя и пароль для сервера печати «%@».";
"PS_MSG_PASS" = "Введите имя пользователя и пароль для сервера печати «%@».";

/* Screen Sharing */
"SS_MSG_BOTH" = "Введите имя и пароль для общего доступа к экрану «%@».";
"SS_MSG_PASS" = "Введите пароль для общего доступа к экрану «%@».";

"VS_MSG_BOTH" = "Введите имя и пароль для просмотра экрана «%@».";
"VS_MSG_PASS" = "Введите пароль для просмотра экрана «%@».";

/* Time Machine */
"TM_MSG_BOTH" = "Введите имя и пароль для обеспечения доступа Time Machine к серверу «%@».";
"TM_MSG_PASS" = "Введите пароль для обеспечения доступа Time Machine к серверу «%@».";

/* Pre Auth */
"PA_MSG_BOTH" = "Введите имя и пароль для прокси-сервера «%@».";
"PA_MSG_PASS" = "Введите пароль для прокси-сервера «%@».";


/* ---------------------------------------------------------------------- */
/* Auth Dialog Buttons */
"CONNECT" = "Подключиться";
"SHARE" = "Общий доступ";
"PRINT" = "Напечатать";
"VIEW" = "Вид";
"OK" = "ОК";

"CONNECT_AS" = "Подключение:";
"GUEST" = "Как гость";
"REGISTERED_USER" = "Как зарегистрированный пользователь";

"CONNECT_BY" = "Подключиться:";
"BY_ASKING_FOR_PERMISSION" = "Запрашивая разрешение";
"AS_REGISTERED_USER" = "Как зарегистрированный пользователь";


/* ---------------------------------------------------------------------- */
/* Tool Tips */
"TOOLTIP_NAME_SMB" = "Домен\\Имя пользователя";

/* ====================================================================== */
/* Share Picker Messages */
"SELECT_VOLUME_ON_SERVER" = "Выберите тома, которые Вы хотите подключить на «%@»:";
"SELECT_VOLUME" = "Выберите тома, чтобы подключить:";

"SELECT_PRINTER_ON_SERVER" = "Выбрать принтер в «%@»:";

/* ---------------------------------------------------------------------- */
/* default western encoding name */
"WESTERN_MAC" = "Western (Mac)";


/* ====================================================================== */
/* Change Password */
"CHANGE_PASSWORD_MSG" = "Измените пароль для «%1$@» на «%2$@».";


/* ====================================================================== */
/* Progress Dialog */
"CONNECTING_TO_GENERIC" = "Подключаюсь…";
"CONNECTING_TO_HOST" = "Подключаюсь к «%@».";


/* ====================================================================== */
/* Volume Password */
"ENTER_VOLUME_PASSWORD_FOR_SERVER" = "Введите пароль для тома «%@» на файловом сервере «%@».";
"ENTER_VOLUME_PASSWORD" = "Введите пароль для «%@».";


/* ====================================================================== */
/* Keychain Kinds */
"NETWORK_PASSWORD" = "Сетевой пароль";
"PRINT_PASSWORD" = "Пароль принтера";
"AFP_PASSWORD" = "Пароль AFP";
"SMB_PASSWORD" = "Пароль SMB";
"FTP_PASSWORD" = "Пароль FTP";
"WEBDAV_PASSWORD" = "Пароль WebDAV";
"VNC_PASSWORD" = "Пароль VNC";


/* ====================================================================== */
/* ---------------------------------------------------------------------- */
/* Error Message Text */
"EMSG_OCCURRED" = "Произошла ошибка.";
"EMSG_INVALID_PWD" = "Вы ввели неверный пароль.";
"EMSG_INVALID_NAME_PWD" = "Вы ввели неверное имя пользователя или пароль.";
"EMSG_PWD_EXPIRED" = "Пароль не действителен.";
"EMSG_PWD_NEEDS_CHANGE" = "Пароль необходимо изменить.";
"EMSG_PWD_POLICY" = "Пароль не совпадает с политикой сервера.";
"EMSG_CONNECTION_FAILED" = "Подключение не удалось";

"EMSG_MOUNT_FAILURE" = "Сбой подключения тома.";

/* ---------------------------------------------------------------------- */
/* Error Info Text */
"EINFO_TRY_AGAIN" = "Попытайтесь еще раз.";
"EINFO_CONTACT_ADMIN" = "Обратитесь к системному администратору за дополнительной информацией.";

"EINFO_NO_ACCESS_USER" = "У Вас нет разрешения на доступ к серверу «%@».";
"EINFO_NO_ACCESS_GUEST" = "Сервер «%@» не предоставляет гостевой доступ.";
"EINFO_SAME_MACHINE" = "Сервер «%@» доступен на Вашем компьютере. Доступ к томам и файлам локально.";
"EINFO_NO_SERVER" = "Возможно, сервер «%@» не существует или недоступен в данный момент. Проверьте имя сервера или его IP-адрес, а также сетевое подключение, а затем повторите попытку.";
"EINFO_TOO_MANY_USERS" = "Вход дополнительных пользователей на сервер «%@» невозможен. Попытайтесь подключиться позже.";
"EINFO_GENERAL" = "Произошла ошибка подключения к серверу «%@». Проверьте имя сервера или IP-адрес, а затем повторите попытку.\n\nЕсли Вы не можете решить проблему, обратитесь к системному администратору.";
"EINFO_NO_SHARES" = "Нет доступных объектов общего доступа или у Вас нет прав для доступа к ним на сервере «%@«. Обратитесь к системному администратору для решения проблемы.";

"EINFO_NO_ACCESS_USER_UNKNOWN" = "У Вас нет разрешения на доступ к этому серверу.";
"EINFO_NO_ACCESS_GUEST_UNKNOWN" = "Этот сервер не предоставляет гостевой доступ.";
"EINFO_SAME_MACHINE_UNKNOWN" = "Этот файловый сервер доступен на Вашем компьютере. Доступ к томам и файлам локально.";
"EINFO_NO_SERVER_UNKNOWN" = "Возможно, сервер не существует или недоступен в данный момент. Проверьте имя сервера или его IP-адрес, а также сетевое подключение, а затем повторите попытку.";
"EINFO_TOO_MANY_USERS_UNKNOWN" = "Этот файловый сервер не разрешает подключение дополнительных пользователей. Попытайтесь подключиться позже.";
"EINFO_GENERAL_UNKNOWN" = "Произошла ошибка подключения к серверу. Проверьте имя сервера или IP-адрес, а затем повторите попытку.\n\nЕсли Вы не можете решить проблему, обратитесь к системному администратору.";
"EINFO_NO_SHARES_UNKNOWN" = "Нет доступных объектов общего доступа или у Вас нет прав для доступа к ним на сервере. Обратитесь к системному администратору для решения проблемы.";

"EINFO_UNKNOWN_MOUNT_FAILED" = "Произошла ошибка подключения к тому.";
"EINFO_ONE_MOUNT_FAILED" = "Не удалось подключить том «%@».";
"EINFO_MULTIPLE_MOUNTS_FAILED" = "Не удалось подключить следующие тома:";
